cvetaevvitaliy/stm32h743_cmake/lib/startup.cpp
/*!	\file starup and initialization file*/
extern "C" void Reset_Handler();//declarations to see it from everywhere
extern "C" void NMI_Handler(); 
extern "C" void HardFault_Handler();
extern "C" void MemManage_Handler() __attribute__((weak,alias("Default_Handler")));
extern "C" void BusFault_Handler() __attribute__((weak,alias("Default_Handler")));
extern "C" void UsageFault_Handler() __attribute__((weak,alias("Default_Handler")));
extern "C" void SVC_Handler() __attribute__((weak,alias("Default_Handler")));
extern "C" void DebugMon_Handler() __attribute__((weak,alias("Default_Handler")));
extern "C" void PendSV_Handler() __attribute__((weak,alias("Default_Handler")));
extern "C" void SysTick_Handler() __attribute__((weak,alias("Default_Handler")));
extern "C" void WWDG_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void PVD_AVD_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void TAMP_STAMP_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void RTC_WKUP_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void FLASH_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void RCC_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void EXTI0_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void EXTI1_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void EXTI2_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void EXTI3_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void EXTI4_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void DMA1_Channel1_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void DMA1_Channel2_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void DMA1_Channel3_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void DMA1_Channel4_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void DMA1_Channel5_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void DMA1_Channel6_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void DMA1_Channel7_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void ADC_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void FDCAN1_IT0_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void FDCAN2_IT0_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void FDCAN1_IT1_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void FDCAN2_IT1_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void RTC_Alarm_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void EXTI9_5_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void TIM1_BRK_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void TIM1_UP_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void TIM1_TRG_COM_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void TIM1_CC_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void TIM2_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void TIM3_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void TIM4_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void I2C1_EV_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void I2C1_ER_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void I2C2_EV_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void I2C2_ER_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void SPI1_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void SPI2_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void USART1_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void USART2_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void USART3_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void EXTI15_10_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void TIM8_BRK_TIM12_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void TIM8_UP_TIM13_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void TIM8_TRG_COM_TIM14_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void TIM8_CC_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void DMA1_Stream7_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void FMC_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void SDMMC1_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void TIM5_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void SPI3_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void UART4_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void UART5_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void TIM6_DAC_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void TIM7_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void DMA2_Stream0_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void DMA2_Stream1_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void DMA2_Stream2_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void DMA2_Stream3_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void DMA2_Stream4_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void ETH_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void ETH_WKUP_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void FDCAN_CAL_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void DMA2_Stream5_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void DMA2_Stream6_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void DMA2_Stream7_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void USART6_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void I2C3_ER_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void I2C3_EV_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void OTG_HS_EP1_OUT_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void OTG_HS_EP1_IN_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void OTG_HS_WKUP_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void OTG_HS_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void DCMI_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void RNG_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void FPU_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void UART7_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void UART8_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void SPI4_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void SPI5_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void SPI6_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void SAI1_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void LTDC_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void LTDC_ER_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void DMA2D_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void SAI2_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void QUADSPI_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void LPTIM1_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void CEC_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void I2C4_EV_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void I2C4_ER_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void SPDIF_RX_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void OTG_FS_EP1_OUT_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void OTG_FS_EP1_IN_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void OTG_FS_WKUP_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void OTG_FS_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void DMAMUX1_OVR_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void HRTIM1_Master_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void HRTIM1_TIMA_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void HRTIM1_TIMB_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void HRTIM1_TIMC_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void HRTIM1_TIMD_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void HRTIM1_TIME_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void HRTIM1_FLT_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void DFSDM1_FLT0_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void DFSDM1_FLT1_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void DFSDM1_FLT2_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void DFSDM1_FLT3_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void SAI3_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void SWPMI1_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void TIM15_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void TIM16_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void TIM17_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void MDIOS_WKUP_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void MDIOS_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void JPEG_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void MDMA_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void SDMMC2_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void HSEM1_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void ADC3_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void DMAMUX2_OVR_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void BDMA_Channel0_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void BDMA_Channel1_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void BDMA_Channel2_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void BDMA_Channel3_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void BDMA_Channel4_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void BDMA_Channel5_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void BDMA_Channel6_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void BDMA_Channel7_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void COMP1_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void LPTIM2_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void LPTIM3_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void LPTIM4_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void LPTIM5_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void LPUART1_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void CRS_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void ECC_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void SAI4_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void WAKEUP_PIN_IRQHandler() __attribute__((weak,alias("Default_Handler")));
extern "C" void Default_Handler();
int main(); //!< declaration main function

